Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxConverter_regdef.h
/** \brief Module Identification Register */
typedef struct _Ifx_CONVERTER_ID_Bits
{
    Ifx_UReg_32Bit MOD_REV:8;         /**< \brief [7:0] Module Revision - MOD_REV (r) */
    Ifx_UReg_32Bit MOD_TYPE:8;        /**< \brief [15:8] Module Type - MOD_TYPE (r) */
    Ifx_UReg_32Bit MOD_NUMBER:16;     /**< \brief [31:16] Module Number - MOD_NUMBER (r) */
} Ifx_CONVERTER_ID_Bits;

/** \brief Kernel Reset Register 0 */
typedef struct _Ifx_CONVERTER_KRST0_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit RSTSTAT:1;         /**< \brief [1:1] Kernel Reset Status - RSTSTAT (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_CONVERTER_KRST0_Bits;

/** \brief Kernel Reset Register 1 */
typedef struct _Ifx_CONVERTER_KRST1_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_CONVERTER_KRST1_Bits;

/** \brief Kernel Reset Status Clear Register */
typedef struct _Ifx_CONVERTER_KRSTCLR_Bits
{
    Ifx_UReg_32Bit CLR:1;             /**< \brief [0:0] Kernel Reset Status Clear - CLR (w) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_CONVERTER_KRSTCLR_Bits;

/** \brief Maximum Value Register */
typedef struct _Ifx_CONVERTER_MAX_Bits
{
    Ifx_UReg_32Bit MAXVALUE:28;       /**< \brief [27:0] Ramp Generator Maxvalue - MAXVALUE (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_CONVERTER_MAX_Bits;

/** \brief Minimum Value Register */
typedef struct _Ifx_CONVERTER_MIN_Bits
{
    Ifx_UReg_32Bit MINVALUE:28;       /**< \brief [27:0] Ramp Generator Minvalue - MINVALUE (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_CONVERTER_MIN_Bits;

/** \brief Miscellaneous Control Register */
typedef struct _Ifx_CONVERTER_MISC_Bits
{
    Ifx_UReg_32Bit WAIT:16;           /**< \brief [15:0] Ramp Generator Wait Time - WAIT (rw) */
    Ifx_UReg_32Bit STAY:1;            /**< \brief [16:16] Ramp Generator Operation Control - STAY (rw) */
    Ifx_UReg_32Bit SWGK:5;            /**< \brief [21:17] Sinewave Generator Frequency - SWGK (rw) */
    Ifx_UReg_32Bit reserved_22:10;    /**< \brief [31:22] \internal Reserved */
} Ifx_CONVERTER_MISC_Bits;

/** \brief OCDS Control and Status Register */
typedef struct _Ifx_CONVERTER_OCS_Bits
{
    Ifx_UReg_32Bit reserved_0:24;     /**< \brief [23:0] \internal Reserved */
    Ifx_UReg_32Bit SUS:4;             /**< \brief [27:24] OCDS Suspend Control - SUS (rw) */
    Ifx_UReg_32Bit SUS_P:1;           /**< \brief [28:28] SUS Write Protection - SUS_P (w) */
    Ifx_UReg_32Bit SUSSTA:1;          /**< \brief [29:29] Suspend State - SUSSTA (rh) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_CONVERTER_OCS_Bits;

/** \brief Phase Synchronizer Configuration Register */
typedef struct _Ifx_CONVERTER_PHSCFG_Bits
{
    Ifx_UReg_32Bit PHSDIV:4;          /**< \brief [3:0] Phase Synchronizer Divider - PHSDIV (rw) */
    Ifx_UReg_32Bit reserved_4:11;     /**< \brief [14:4] \internal Reserved */
    Ifx_UReg_32Bit PDWC:1;            /**< \brief [15:15] Write Control for Phase Sync. Divider - PDWC (w) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CONVERTER_PHSCFG_Bits;

/** \brief P/I Regulator Configuration Register */
typedef struct _Ifx_CONVERTER_PICFG_Bits
{
    Ifx_UReg_32Bit PVALUE:8;          /**< \brief [7:0] P-Parameter for the P-I Regulator - PVALUE (rw) */
    Ifx_UReg_32Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit IVALUE:8;          /**< \brief [23:16] I-Parameter for the P-I Regulator - IVALUE (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CONVERTER_PICFG_Bits;

/** \brief Sinewave Gen. Config. Register, A-Factor */
typedef struct _Ifx_CONVERTER_SGCFGA_Bits
{
    Ifx_UReg_32Bit reserved_0:16;     /**< \brief [15:0] \internal Reserved */
    Ifx_UReg_32Bit SWGA:16;           /**< \brief [31:16] Sinewave Generator Amplitude - SWGA (rw) */
} Ifx_CONVERTER_SGCFGA_Bits;

/** \brief Sinewave Gen. Config. Register, K-Factor */
typedef struct _Ifx_CONVERTER_SGCFGK_Bits
{
    Ifx_UReg_32Bit SWGK:32;           /**< \brief [31:0] Sinewave Generator Frequency - SWGK (rw) */
} Ifx_CONVERTER_SGCFGK_Bits;

/** \brief Shift Register */
typedef struct _Ifx_CONVERTER_SHIFT_Bits
{
    Ifx_UReg_32Bit SHPAT:32;          /**< \brief [31:0] Shift Register Pattern - SHPAT (rw) */
} Ifx_CONVERTER_SHIFT_Bits;

/** \brief Slope Configuration Register */
typedef struct _Ifx_CONVERTER_SLOPE_Bits
{
    Ifx_UReg_32Bit SLOPEVALUE:22;     /**< \brief [21:0] Ramp Generator Slope - SLOPEVALUE (rw) */
    Ifx_UReg_32Bit reserved_22:10;    /**< \brief [31:22] \internal Reserved */
} Ifx_CONVERTER_SLOPE_Bits;

/** \brief Test Configuration Register */
typedef struct _Ifx_CONVERTER_TESTCFG_Bits
{
    Ifx_UReg_32Bit SINEN:1;           /**< \brief [0:0] Sinewave Generator Enable - SINEN (rw) */
    Ifx_UReg_32Bit SHIFTEN:1;         /**< \brief [1:1] Shift Register Enable - SHIFTEN (rw) */
    Ifx_UReg_32Bit RAMPEN:1;          /**< \brief [2:2] Ramp Generator Enable - RAMPEN (rw) */
    Ifx_UReg_32Bit CTRLEN:1;          /**< \brief [3:3] PI Regulator Enable - CTRLEN (rw) */
    Ifx_UReg_32Bit PPEN:1;            /**< \brief [4:4] Push-Pull Enable - PPEN (rw) */
    Ifx_UReg_32Bit PPDCAP:1;          /**< \brief [5:5] Push-Pull Double Capacitor Select - PPDCAP (rw) */
    Ifx_UReg_32Bit PPPROG:4;          /**< \brief [9:6] Push-Pull Programming - PPPROG (rw) */
    Ifx_UReg_32Bit PPSCC:2;           /**< \brief [11:10] Push-Pull Switched Capacitance Clock Select - PPSCC (rw) */
    Ifx_UReg_32Bit FROMTB:1;          /**< \brief [12:12] PI Regulator Input Select - FROMTB (rw) */
    Ifx_UReg_32Bit ONEAHALF:1;        /**< \brief [13:13] Sigma-Delta Generator Output Format - ONEAHALF (rw) */
    Ifx_UReg_32Bit BLOCKSEL:6;        /**< \brief [19:14] PI Regulator Input Handshake Select - BLOCKSEL (rw) */
    Ifx_UReg_32Bit PPTEST:1;          /**< \brief [20:20] Push-Pull Test - PPTEST (rw) */
    Ifx_UReg_32Bit PPFDN:1;           /**< \brief [21:21] Push-Pull Force Down - PPFDN (rw) */
    Ifx_UReg_32Bit PPFUP:1;           /**< \brief [22:22] Push-Pull Force Up - PPFUP (rw) */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit CLKASYN:1;         /**< \brief [24:24] Clock Synchronizer: Unsynchronized Clock Generation - CLKASYN (rw) */
    Ifx_UReg_32Bit CLKDEL:3;          /**< \brief [27:25] Clock Synchronizer: Analog Clock Synchronization Delay - CLKDEL (rw) */
    Ifx_UReg_32Bit CLKDIV:3;          /**< \brief [30:28] Clock Synchronizer: Modulator Clock Period - CLKDIV (rw) */
    Ifx_UReg_32Bit CLKEN:1;           /**< \brief [31:31] Clock Synchronizer: Clock Enable - CLKEN (rw) */
} Ifx_CONVERTER_TESTCFG_Bits;

/** \brief Voltage Regulator Configuration Register */
typedef struct _Ifx_CONVERTER_VRCFG_Bits
{
    Ifx_UReg_32Bit BDON:2;            /**< \brief [1:0] Bias Distributor and Supply Monitoring Enable - BDON (rw) */
    Ifx_UReg_32Bit SUPLEV:2;          /**< \brief [3:2] Supply Voltage Level - SUPLEV (rw) */
    Ifx_UReg_32Bit ITRIM:3;           /**< \brief [6:4] Trim Value for Reference Current - ITRIM (rw) */
    Ifx_UReg_32Bit BGMON:1;           /**< \brief [7:7] Enable Bandgap Monitoring - BGMON (rw) */
    Ifx_UReg_32Bit IREFSEL:1;         /**< \brief [8:8] Bandgap Select for IREF Current - IREFSEL (rw) */
    Ifx_UReg_32Bit VREFSEL:1;         /**< \brief [9:9] Bandgap Select for VREF Current - VREFSEL (rw) */
    Ifx_UReg_32Bit reserved_10:5;     /**< \brief [14:10] \internal Reserved */
    Ifx_UReg_32Bit VRWC:1;            /**< \brief [15:15] Write Control for Voltage Regulator Control - VRWC (w) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CONVERTER_VRCFG_Bits;

/** \brief Voltage Regulator Status Register */
typedef struct _Ifx_CONVERTER_VRSTAT_Bits
{
    Ifx_UReg_32Bit BGOK:1;            /**< \brief [0:0] Bandgap Monitoring Status Flag - BGOK (rh) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_CONVERTER_VRSTAT_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_converter_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_ACCEN0_Bits B;      /**< \brief Bitfield access */
} Ifx_CONVERTER_ACCEN0;

