Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxConverter_regdef.h
/** \brief Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_ACCEN1_Bits B;      /**< \brief Bitfield access */
} Ifx_CONVERTER_ACCEN1;

/** \brief Converter Control Block Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_CCCTRL_Bits B;      /**< \brief Bitfield access */
} Ifx_CONVERTER_CCCTRL;

/** \brief Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_CLC_Bits B;         /**< \brief Bitfield access */
} Ifx_CONVERTER_CLC;

/** \brief Flags Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_FLAGS_Bits B;       /**< \brief Bitfield access */
} Ifx_CONVERTER_FLAGS;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_ID_Bits B;          /**< \brief Bitfield access */
} Ifx_CONVERTER_ID;

/** \brief Kernel Reset Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_KRST0_Bits B;       /**< \brief Bitfield access */
} Ifx_CONVERTER_KRST0;

/** \brief Kernel Reset Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_KRST1_Bits B;       /**< \brief Bitfield access */
} Ifx_CONVERTER_KRST1;

/** \brief Kernel Reset Status Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_KRSTCLR_Bits B;     /**< \brief Bitfield access */
} Ifx_CONVERTER_KRSTCLR;

/** \brief Maximum Value Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_MAX_Bits B;         /**< \brief Bitfield access */
} Ifx_CONVERTER_MAX;

/** \brief Minimum Value Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_MIN_Bits B;         /**< \brief Bitfield access */
} Ifx_CONVERTER_MIN;

/** \brief Miscellaneous Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_MISC_Bits B;        /**< \brief Bitfield access */
} Ifx_CONVERTER_MISC;

/** \brief OCDS Control and Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_OCS_Bits B;         /**< \brief Bitfield access */
} Ifx_CONVERTER_OCS;

/** \brief Phase Synchronizer Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_PHSCFG_Bits B;      /**< \brief Bitfield access */
} Ifx_CONVERTER_PHSCFG;

/** \brief P/I Regulator Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_PICFG_Bits B;       /**< \brief Bitfield access */
} Ifx_CONVERTER_PICFG;

/** \brief Sinewave Gen. Config. Register, A-Factor   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_SGCFGA_Bits B;      /**< \brief Bitfield access */
} Ifx_CONVERTER_SGCFGA;

/** \brief Sinewave Gen. Config. Register, K-Factor   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_SGCFGK_Bits B;      /**< \brief Bitfield access */
} Ifx_CONVERTER_SGCFGK;

/** \brief Shift Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_SHIFT_Bits B;       /**< \brief Bitfield access */
} Ifx_CONVERTER_SHIFT;

/** \brief Slope Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_SLOPE_Bits B;       /**< \brief Bitfield access */
} Ifx_CONVERTER_SLOPE;

/** \brief Test Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_TESTCFG_Bits B;     /**< \brief Bitfield access */
} Ifx_CONVERTER_TESTCFG;

/** \brief Voltage Regulator Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_VRCFG_Bits B;       /**< \brief Bitfield access */
} Ifx_CONVERTER_VRCFG;

/** \brief Voltage Regulator Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CONVERTER_VRSTAT_Bits B;      /**< \brief Bitfield access */
} Ifx_CONVERTER_VRSTAT;

/** \}  */

/******************************************************************************/
/** \addtogroup IfxLld_Converter_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief CONVERTER object */
typedef volatile struct _Ifx_CONVERTER
{
       Ifx_CONVERTER_CLC                   CLC;                    /**< \brief 0, Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_CONVERTER_ID                    ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[28];         /**< \brief C, \internal Reserved */
       Ifx_CONVERTER_OCS                   OCS;                    /**< \brief 28, OCDS Control and Status Register*/
       Ifx_CONVERTER_KRSTCLR               KRSTCLR;                /**< \brief 2C, Kernel Reset Status Clear Register*/
       Ifx_CONVERTER_KRST1                 KRST1;                  /**< \brief 30, Kernel Reset Register 1*/
       Ifx_CONVERTER_KRST0                 KRST0;                  /**< \brief 34, Kernel Reset Register 0*/
       Ifx_CONVERTER_ACCEN1                ACCEN1;                 /**< \brief 38, Access Enable Register 1*/
       Ifx_CONVERTER_ACCEN0                ACCEN0;                 /**< \brief 3C, Access Enable Register 0*/
       Ifx_UReg_8Bit                       reserved_40[60];        /**< \brief 40, \internal Reserved */
       Ifx_CONVERTER_CCCTRL                CCCTRL;                 /**< \brief 7C, Converter Control Block Control Register*/
       Ifx_CONVERTER_PHSCFG                PHSCFG;                 /**< \brief 80, Phase Synchronizer Configuration Register*/
       Ifx_UReg_8Bit                       reserved_84[28];        /**< \brief 84, \internal Reserved */
       Ifx_CONVERTER_VRCFG                 VRCFG;                  /**< \brief A0, Voltage Regulator Configuration Register*/
       Ifx_CONVERTER_VRSTAT                VRSTAT;                 /**< \brief A4, Voltage Regulator Status Register*/
       Ifx_UReg_8Bit                       reserved_A8[24];        /**< \brief A8, \internal Reserved */
       Ifx_CONVERTER_PICFG                 PICFG;                  /**< \brief C0, P/I Regulator Configuration Register*/
       Ifx_CONVERTER_SGCFGA                SGCFGA;                 /**< \brief C4, Sinewave Gen. Config. Register, A-Factor*/
       Ifx_CONVERTER_SGCFGK                SGCFGK;                 /**< \brief C8, Sinewave Gen. Config. Register, K-Factor*/
       Ifx_CONVERTER_SLOPE                 SLOPE;                  /**< \brief CC, Slope Configuration Register*/
       Ifx_CONVERTER_MIN                   MIN;                    /**< \brief D0, Minimum Value Register*/
       Ifx_CONVERTER_MAX                   MAX;                    /**< \brief D4, Maximum Value Register*/
       Ifx_CONVERTER_SHIFT                 SHIFT;                  /**< \brief D8, Shift Register*/
       Ifx_CONVERTER_TESTCFG               TESTCFG;                /**< \brief DC, Test Configuration Register*/
       Ifx_CONVERTER_FLAGS                 FLAGS;                  /**< \brief E0, Flags Register*/
       Ifx_CONVERTER_MISC                  MISC;                   /**< \brief E4, Miscellaneous Control Register*/
       Ifx_UReg_8Bit                       reserved_E8[65303];     /**< \brief E8, \internal Reserved */
} Ifx_CONVERTER;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCONVERTER_REGDEF_H */
